[
  "Cope terminal, turned $2k into $150k on TROLL then back to $1.8k during a Zoom. Need a detox from charts and a reset routine.",
  "Been averaging down on Cupsey for months; wife thinks it's vacation savings. How do I confess and stop adding on every red candle?",
  "Unstable coin paid me in hypertension. Request: discipline rebuild plan and a budget that survives FOMO.",
  "Sold my car for BAGWORK 'support' that wasn't there. How do I stop calling dips that turn into cliffs?",
  "Day-traded CHILLHOUSE during my review; manager noticed. Boundaries between job and trades, please.",
  "Fartcoin was a joke until the credit card bill arrived. How do I detach emotions and follow a plan?",
  "StreamerCoin rugged mid-stream; we were early to zero. Checklist to avoid obvious traps before I click buy.",
  "$Runner pumped while I was out running, dumped when I returned. How do I handle regret spirals without revenge trading?",
  "YOLO'd Kindness coin at ATH because it felt wholesome. Teach me entry criteria beyond vibes.",
  "Tokabu ate my emergency fund after a 'short consolidation'. What's a sane cash management plan so rent money stays sacred?",
  "ASSDAQ made me rich for a weekend, nauseous by Monday. Need an exit strategy template to avoid live-narrating my downfall.",
  "Trencher Broadcasting Company aired my panic to the group chat. How do I stop trying to win it all back on the next chart?",
  "$RETIRE made me believe in destiny for six hours. I want a simple trading journal I can stick to daily.",
  "Wedding fund went to Cupsey for 'quick gains'. What's the honest way to own it and build safeguards?",
  "Sold my gaming PC for TROLL; now I trade on a cracked phone at McDonald's WiFi. Routine to stop price-checking every 3 minutes.",
  "Unstable coin nuked my sleep. What practical steps limit screen time and reduce stress while still participating?",
  "BAGWORK was my personality for a month; humility is now. Define max position sizes so I stop going all-in on vibes.",
  "CHILLHOUSE wasn't chill; I became bag concierge. What rules for entries, stops, and take-profits stick for a rule-breaker?",
  "Fartcoin memes felt like community; collections feel less fun. Looking for community without mistaking it for due diligence.",
  "StreamerCoin gave me content and consequences. How do I verify liquidity, team, and risk before buy?",
  "$Runner taught me cardio and coping. Need a process to forgive top-ticks and avoid chasing the next candle.",
  "Kindness coin wasn't kind to my savings. What three non-negotiables should I implement today?",
  "Tokabu's mascot looked trustworthy; my bank balance disagreed. Build me an if-then plan that blocks emotional clicks.",
  "ASSDAQ had me naming yachts, then bus routes. How do I ladder exits so I secure gains despite greed?",
  "Trencher cost me an apartment approval. Need a plan to rebuild an emergency fund while trading responsibly.",
  "$REHIRE arc unlocked after $RETIRE. Can you outline a weekly routine balancing work, learning, and safe practice?",
  "Cupsey ruined family dinner when I checked charts mid-toast. I want no-phone windows I can actually honor.",
  "TROLL turned my TED talk on tokenomics into a ramen budget lecture. How do I talk about losses without spiraling into shame?",
  "Unstable coin taught volatility; I need stability. Set a maximum daily PnL swing rule so I walk away instead of doubling down.",
  "BAGWORK was 'the one' until it wasn't. What post-mortem process actually changes behavior?",
  "CHILLHOUSE sold me chill vibes and delivered stress. Template for pre-trade thesis and invalidation, please.",
  "Fartcoin 10x screenshots haunt me; I bought after the parade. How do I accept missing moves without chasing the next cliff?",
  "StreamerCoin turned my stream into therapy. Boundaries for trading on-stream vs off so decisions aren't content.",
  "$Runner had me sprinting to the bottom. Give me a one-page risk plan for small accounts that doesn't need miracles.",
  "Kindness coin drama spilled into joint finances. Need trust-rebuild steps and guardrails on shared money.",
  "Tokabu and I are toxic; I keep returning. How do I enforce cool-off periods and max daily trades?",
  "ASSDAQ: ignored my stop, then my stop ignored me. Automate discipline so I'm not negotiating mid-candle.",
  "Trencher broadcasted my panic sell. How do I turn mistakes into data without numbing myself with more trades?",
  "$RETIRE almost worked, then didn't. Define success metrics beyond 'number go up' so identity isn't tied to PnL."
]
